HELYXcore-4.4.0/examples/legacy/multiphase/interIsoFoam/notchedDiscInSolidBodyRotation/Allrun
#!/bin/bash
cd ${0%/*} || exit 1    # run from this directory

# Source tutorial run functions
. $HELYX_PROJECT_DIR/bin/tools/RunFunctions

application=$(getApplication)

restore0Dir

runApplication blockMesh

runApplication -s postProcess ${application} -postProcess -time 0

runApplication setAlphaField

runApplication setFields

runApplication ${application}
