HELYXcore-4.4.0/examples/legacy/multiphase/interIsoFoam/notchedDiscInSolidBodyRotation/constant/transportProperties
/*--------------------------------*- C++ -*----------------------------------*\
|       o        |                                                            |
|    o     o     |  HELYX (R) : Open-source CFD for Enterprise                |
|   o   O   o    |  Version : 4.4.0                                           |
|    o     o     |  ENGYS Ltd. <http://engys.com/>                            |
|       o        |                                                            |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "constant";
    object      transportProperties;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

phases          (water air);

water
{
    transportModel  Newtonian;
    nu              0;
    rho             1000;
}

air
{
    transportModel  Newtonian;
    nu              0;
    rho             1;
}

sigma           0;


// ************************************************************************* //
