HELYXcore-4.4.0/examples/legacy/multiphase/interIsoFoam/notchedDiscInSolidBodyRotation/system/controlDict
/*--------------------------------*- C++ -*----------------------------------*\
|       o        |                                                            |
|    o     o     |  HELYX (R) : Open-source CFD for Enterprise                |
|   o   O   o    |  Version : 4.4.0                                           |
|    o     o     |  ENGYS Ltd. <http://engys.com/>                            |
|       o        |                                                            |
\*---------------------------------------------------------------------------*/

FoamFile
{
    version         2.0;
    format          ascii;
    class           dictionary;
    location        "system";
    object          controlDict;
}

// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

application     interIsoFoam;

startFrom       latestTime;

startTime       0.0;

stopAt          endTime;

endTime         2;

writeControl    adjustableRunTime;

writeInterval   0.05;

deltaT          0.001;

purgeWrite      0;

writeFormat     ascii;

writePrecision  14;

writeCompression off;

timeFormat      general;

timePrecision   6;

graphFormat     raw;

runTimeModifiable no;

adjustTimeStep  no;

maxCo           1e6;
maxAlphaCo      0.5;

maxDeltaT       0.05;

functions
{
    setVelocity
    {
        type            setFlow;
        libs            ("libfieldFunctionObjects.so");
        writeControl    writeTime;
        mode            rotation;
        scale           1;
        reverseTime     1;
        omega           6.28318530718;
        origin          (0.5 0 0.5);
        refDir          (1 0 0);
        axis            (0 1 0);
    }
}

// ************************************************************************* //
